SolutionApps/App.Solutions/App.WebAPIConfigService/App_Data/ApiLogFiles/UserLogFiles/BJDPPVNFP7/EnhancedBookMultiSegmentRQ.log

<?xml version='1.0' encoding='UTF-8'?><soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:sec="http://schemas.xmlsoap.org/ws/2002/12/secext" xmlns:eb="http://www.ebxml.org/namespaces/messageHeader"><soapenv:Header>  <eb:MessageHeader soapenv:mustUnderstand="1" eb:version="1.0">       <eb:From>           <eb:PartyId eb:type="urn: x12.org:IO5: 01">999999</eb:PartyId>       </eb:From>       <eb:To>           <eb:PartyId type="urn:x12.org:IO5:01">123123</eb:PartyId>       </eb:To>       <eb:CPAId>3RT2</eb:CPAId>       <eb:ConversationId>1111111111111111111</eb:ConversationId>       <eb:Service eb:type="sabreXML">EnhancedAirBookRQ</eb:Service>       <eb:Action>EnhancedAirBookRQ</eb:Action>       <eb:MessageData>           <eb:MessageId>mid:0_2014-09-22T21:43:40m</eb:MessageId>           <eb:Timestamp>2014-09-22T21:43:40</eb:Timestamp>           <eb:TimeToLive>2014-09-22T21:43:40</eb:TimeToLive>       </eb:MessageData>       <eb:DuplicateElimination/>       <eb:Description>Air Book Service</eb:Description>   </eb:MessageHeader>   <sec:Security xmlns:wsse="http://schemas.xmlsoap.org/ws/2002/12/secext" xmlns:wsu="http://schemas.xmlsoap.org/ws/2002/12/utility">       <sec:BinarySecurityToken>Shared/IDL:IceSess\/SessMgr:1\.0.IDL/Common/!ICESMS\/RESA!ICESMSLB\/RES.LB!1541384881771!7500706!655361</sec:BinarySecurityToken>   </sec:Security></soapenv:Header><soapenv:Body>    <EnhancedAirBookRQ  xmlns="http://services.sabre.com/sp/eab/v3_6"  version="3.6.0" IgnoreOnError="true" HaltOnError="false" >     <OTA_AirBookRQ>   <RetryRebook Option="true"/>   <HaltOnStatus Code="NO"/>   <HaltOnStatus Code="NN"/>   <HaltOnStatus Code="UC"/>   <HaltOnStatus Code="US"/>   <HaltOnStatus Code="WL"/>   <HaltOnStatus Code="HL"/>   <HaltOnStatus Code="UN"/>   <HaltOnStatus Code="PN"/>   <HaltOnStatus Code="LL"/>      <OriginDestinationInformation>   <FlightSegment DepartureDateTime="2019-03-08T11:26" ArrivalDateTime="2019-03-08T12:41" FlightNumber="456" NumberInParty="1" ResBookDesigCode="T" Status="NN">      <DestinationLocation   LocationCode="DEN"/>      <Equipment AirEquipType="319"/>      <MarketingAirline Code="UA" FlightNumber="456"/>      <OperatingAirline Code="UA"/>      <OriginLocation   LocationCode="AUS"/>     </FlightSegment>   <FlightSegment DepartureDateTime="2019-03-08T16:20" ArrivalDateTime="2019-03-09T09:50" FlightNumber="9458" NumberInParty="1" ResBookDesigCode="T" Status="NN">      <DestinationLocation   LocationCode="MUC"/>      <Equipment AirEquipType="359"/>      <MarketingAirline Code="UA" FlightNumber="9458"/>      <OperatingAirline Code="LH"/>      <OriginLocation   LocationCode="DEN"/>     </FlightSegment>   <FlightSegment DepartureDateTime="2019-03-09T12:15" ArrivalDateTime="2019-03-10T00:10" FlightNumber="9236" NumberInParty="1" ResBookDesigCode="T" Status="NN">      <DestinationLocation   LocationCode="DEL"/>      <Equipment AirEquipType="359"/>      <MarketingAirline Code="UA" FlightNumber="9236"/>      <OperatingAirline Code="LH"/>      <OriginLocation   LocationCode="MUC"/>     </FlightSegment>   <FlightSegment DepartureDateTime="2019-03-22T01:50" ArrivalDateTime="2019-03-22T05:40" FlightNumber="9237" NumberInParty="1" ResBookDesigCode="T" Status="NN">      <DestinationLocation   LocationCode="MUC"/>      <Equipment AirEquipType="359"/>      <MarketingAirline Code="UA" FlightNumber="9237"/>      <OperatingAirline Code="LH"/>      <OriginLocation   LocationCode="DEL"/>     </FlightSegment>   <FlightSegment DepartureDateTime="2019-03-22T11:40" ArrivalDateTime="2019-03-22T17:40" FlightNumber="160" NumberInParty="1" ResBookDesigCode="T" Status="NN">      <DestinationLocation   LocationCode="IAH"/>      <Equipment AirEquipType="763"/>      <MarketingAirline Code="UA" FlightNumber="160"/>      <OperatingAirline Code="UA"/>      <OriginLocation   LocationCode="MUC"/>     </FlightSegment>   <FlightSegment DepartureDateTime="2019-03-22T19:50" ArrivalDateTime="2019-03-22T20:49" FlightNumber="2038" NumberInParty="1" ResBookDesigCode="T" Status="NN">      <DestinationLocation   LocationCode="AUS"/>      <Equipment AirEquipType="739"/>      <MarketingAirline Code="UA" FlightNumber="2038"/>      <OperatingAirline Code="UA"/>      <OriginLocation   LocationCode="IAH"/>     </FlightSegment>      </OriginDestinationInformation>     <RedisplayReservation NumAttempts="2" WaitInterval="5000"/>     </OTA_AirBookRQ> <PostProcessing IgnoreAfter ="false">   <RedisplayReservation WaitInterval ="5000"/> </PostProcessing>    </EnhancedAirBookRQ>   </soapenv:Body></soapenv:Envelope>